const logger = require('@/utils/logger');

module.exports = (req, res) => {
  res.json({
    success: true,
    data: [
      {
        id: '开发中1',
        title: '开发中1',
        desc: '王守仁（1472～1529），中国明代哲学家、教育家、军事家、文学家。字伯安，浙江余姚人。因筑室会稽阳明洞，自号阳明子，世称阳明先生。他28岁中进士后在京师任刑部云南清吏司主事、兵部武选清吏司主事，并主考山东乡试。后因弹劾宦官刘瑾，谪为贵州龙场驿丞。',
        thumbnail: '@resources/dynamic/images/blog/food.jpg',
      },
      {
        id: '开发中2',
        title: '开发中2',
        desc: '正德三年时他发生重要的思想转变，以为圣人之道，吾性自足，于是背弃朱熹向外穷理的格物致知说，并在当地建立龙冈书院。贵州提学副使席书聘其主讲贵阳文明书院，他在此首次演讲知行合一说。不久，赦归为江西庐陵知县。此后，历任南京刑部、吏部清吏司主事，南京太仆寺少卿，鸿胪寺卿，都察院左佥都御史等职。正德八年至滁州督马政，讲学规模渐大，一度强调静坐，要求就思虑萌动处省察克治。',
        thumbnail: '@resources/dynamic/images/blog/moon.jpg',
      },
      {
        id: '开发中3',
        title: '开发中3',
        desc: '正德十一年，升任南赣佥都御史，奉命清剿赣南山贼。在军事镇压取得成功后，强调思想统治，重视教化，使赣南的统治秩序得到恢复。这期间他在赣县修建濂溪书院，刻印古本《大学》，印发《朱子晚年定论》、其弟子薛侃出版了《传习录》。',
        thumbnail: '@resources/dynamic/images/blog/wood.jpg',
      },
      {
        id: '开发中4',
        title: '开发中4',
        desc: '正德十四年他升任都察院右副都御史，六月，他奉旨督兵讨伐宁王朱宸濠在南昌发动的叛乱。仅用35日即生擒朱宸濠。他从自己的经历中，总结了经验，提出“致良知”的学术宗旨，认为这是从百死千难中得来，若信得这三字，譬之操舟得舵。',
        thumbnail: '@resources/dynamic/images/blog/wood.jpg',
      },
      {
        id: '开发中5',
        title: '开发中5',
        desc: '50岁时升至南京兵部尚书。后退职回乡。晚年又总督两广军务，病死归途。遗著有《王文成公全书》38卷。',
        thumbnail: '@resources/dynamic/images/blog/food.jpg',
      },
      {
        id: '开发中6',
        title: '开发中6',
        desc: '朱子主张知先行后、行重知轻。王阳明提出的“知行合一”虽然继续了朱子重行的传统，但是批判了朱子割裂知行。王阳明主张知行合一乃是由心即理立基，批评朱子也是指出他根本上是析心与理为二。他说：“外心以求理，此知行之所以二也。求理于吾心，此圣门知行合一之教。”“知行合一”的含意是说知行是一件事的两个方面。知是心之本体的良知；良知充塞流行、发而为客观具体的行动或事物，就是行。由这个认识出发，如果知而不行那只是不知。知是行的主意，行是知的功夫。知行本是紧密相联的，因此有知行合一之说。在当时社会上、在理学发展中的确有知而不行的情况存在。王阳明的知行合一对时弊有纠偏的意义。但是他强调知行合一说不是仅仅针对时弊提出的，它首先是要说明“知行之本体”。知行合一说强调道德意识本来就存在于人心中，这是道德的自觉性。它也强调道德的实践性，认为道德方面的知不是关于对象的知识，而是道德的实现。知行合一也有一般认识论方面的意义，但它首先讲的是道德修养，对于后者长期以来学术界一直没有深入研究。',
        thumbnail: '@resources/dynamic/images/blog/wood.jpg',
      },
    ],
  });
};
