{"ch":{"name":"叶洲洋","title":"前端工程师","web":"bewhat1wannabe.tech","about":["我在web开发领域拥有五年以上的工作经验，主要使用React，TypeScript和NodeJS技术栈，也乐意尝试其它的技术栈。","目前已离职，可立即上岗。"],"skill":["双语言沟通（中文和英文）","领导能力","团队合作"],"contact":{"phone":"15268159839","email":"810036635@qq.com","wechat":"bewhat1wannabe","location":"浙江杭州","github":"https://github.com/ZhouyangYe"},"interests":["每天跑步三到五公里","游戏","锻炼","笛子"],"education":[{"major":"计算机科学本科","time":"2015 年 5 月","school":"新不伦瑞克大学，弗雷德里克顿，新不伦瑞克，加拿大"},{"major":"网络工程","time":"2012 年 2 月","school":"中国地质大学，湖北武汉"}],"experience":[{"title":"前端工程师","time":"2019 年 10 月 - 2021 年 9 月","company":"法本信息技术有限公司，浙江杭州","disc":["参与支付宝大数据项目中的可视化和商业逻辑开发，使用React，Redux，TypeScript技术栈。","和pd，设计，测试人员以及后端协调沟通，提供可行的技术方案，确保应用易使用，代码易维护及尽可能降低开发成本。","设计和开发复杂的可视化组件(树形数据管理UI，MAU/DAU波动分析表等)，项目架构改造，大量页面重构优化，提升用户体验。","作为独立交付TL，帮助组员解决问题，共同学习成长。","开发的用户增长项目从原来每日几十的UV到后来的200多。"]},{"title":"全栈工程师","time":"2017 年 1 月 - 2019 年 6 月","company":"Lixar IT INC，渥太华，安大略省，加拿大","disc":["参与开发了两个加拿大贝尔客户端应用（贝尔公司技术人员流程管理系统和数据分析系统），使用NodeJS、React、Redux技术栈，获取了大量有关 Docker、Webpack以及复杂NodeJS多模块管理架构的开发经验，参与实现了离线功能，redis缓存，数据库管理，双语言切换，本地离线开发环境，CI，打印，邮件推送等功能。","使用.NET开发了IOT大楼设施管理系统的后端API.","参与加拿大贝尔产品管理系统的代码维护，使用JAVA Tapestry框架开发。","参与了项目开发中的各个环节，从程序设计，架构设计，项目流程规划到写代码，部署，以及给客户提供技术支持等。我致力于写出高质量的符合团队标准的代码，以及在需要的时候提出自己的建议（严格的 lint 规则，单元测试以及 code review）。"]},{"title":"技术主管及导师","time":"2016 年 8 月 - 2018 年 1 月","company":"CANA association，渥太华，安大略，加拿大","disc":["带领CANA学员团队设计开发课程预约系统，用于给学员预约导师课程以及发布相关文章。（AngularJS，PHP）。","教授学员web应用开发方面的知识，以及如何准备求职过程中的技术面试。"]},{"title":"个人项目","time":"\\empty","company":"\\empty","disc":["管理和开发一个手机的电商系统，提供订单管理，商品管理，商品硬件对比，excel批量导入商品信息，注册/登陆，权限管理，爬虫等功能。（TypeScript，React，Redux，Antd，Expressjs，MySQL）","搭建脚手架，需求商议和制定、数据结构以及数据库设计，设计和开发页面UI，服务器租用，调试，部署。","业余游戏开发。用业余时间开发自己的体素游戏引擎，目前实现了greedy meshing算法减少三角形个数，ray casting算法计算镜头选中的方块，merge sort算法由远到近渲染半透明物体，创建World Generation线程即时生成地形，AABB collision算法等。（C++，BGFX，CMAKE，GLFW，GLM，IMGUI）","个人网站开发。为了尝试各种技术，使用原生TypeScript，NodeJS从零开始开发了一个个人网站，构建脚手架，借鉴ExpressJS开发了自己的路由系统，实现了Middleware，开发了自己的指令行工具，集成了webpack编译功能，制定Lint规则，使用Cryptojs加密开发了基于Session，Cookie的简易登陆系统，基于Socket.io开发的网络小游戏，开发了自己的简历编辑器，等等。（TypeScript，Nodejs，HTML，LESS，Webpack）"]}],"techSkill":{"skill":["JavaScript","TypeScript","HTML","CSS","React","Redux","Webpack","LESS/SCSS","GIT","Agile(SCRUM) Development"],"familiar":["NodeJs","C++","JAVA","PHP","SQL","Docker","Linux","Redis","GraphQL"]}},"en":{"name":"Zhouyang Ye","title":"Frontend Engineer","web":"bewhat1wannabe.tech","about":["I'm a Senior Web Developer with over 5 years of industry experience, mainly focused on a React, TypeScript and Nodejs stack, also open to exploring other stacks.","Currently self-employed, available to be contacted anytime."],"skill":["Bilingual (Mandarin and English)","Leadership","Team work"],"contact":{"phone":"15268159839","email":"810036635@qq.com","wechat":"bewhat1wannabe","location":"Hangzhou, Zhejiang","github":"https://github.com/ZhouyangYe"},"interests":["Run 3k-5k every day","Gaming","Work out","Playing flute"],"education":[{"major":"Bachelor of Computer Science","time":"May 2015","school":"University of New Brunswick, Fredericton, NB, Canada"},{"major":"Network Engineering","time":"Feb 2012","school":"China University of Geosciences, Wuhan, Hubei, China"}],"experience":[{"title":"Frontend Engineer","time":"Oct 2019 - Sep 2021","company":"Farben Information Technology, Hangzhou, Zhejiang, China","disc":["Worked on the visualization and business logic development of big data projects for Ant Financial Services Group, tech base is React, Redux and TypeScript stack.","Collaborate with PD, designer, QA and back-end developers to reach a balanced solution, make our app easy to use and easy to maintain, reduce development costs.","Designed and developed complex visualization components(tree data structure management UI, DAU/MAU analysis table, etc), refactor project code to improve UX.","As a TL, I'm in charge of some development tasks, and work closely with my teammates, do whatever I can to help them grow.","Increased UV of our app from around 50 per day in the early time to over 200."]},{"title":"Full stack developer","time":"Jan 2017 - Jun 2019","company":"Lixar IT INC, Ottawa, ON, Canada","disc":["Worked on two major front-end solutions(Technician workflow management and data analysis system) developed in NodeJs, React and Redux stack. Gained extensive experience with Docker, Webpack and complex submodule Node applications. Participated in implementing features such as offline access, caching, database management, localization, local dev environments, continuous integration, printing, email push notification, etc.","Implemented backend APIs for building management IOT system using .NET.","Assist in the code maintenance of Bell Product Management System \"SIMPLe\" developed in Java Tapestry.","Participate in full development life-cycle, from architecture design, and planning to coding, deployment, and providing technical support to customers. I'm looking to build excellent quality code, following team standards, and proposing improvements where needed(Strict lint rules, unit tests and code reviews)."]},{"title":"Technical Team Lead and Mentor","time":"Aug 2016 - Jan 2018","company":"CANA association, Ottawa, ON, Canada","disc":["Lead the team of CANA's students to create an appointment booking web system(for education purpose, and booking appointments with mentors) using AngularJS and PHP.","Teach students web dev technologies, and how to prepare for technical interviews."]},{"title":"Self Projects","time":"\\empty","company":"\\empty","disc":["Manage and develop an e-commerce  system for selling phones. Implemented features such as order management, products management, register/login, import product data from excel, hardware comparison, privilege management, web crawler, etc. (TypeScript, React, Redux, Antd, Expressjs, MySQL)","Amateur game dev, recently I'm creating my own voxel game engine, implemented greedy meshing algorithm to reduce triangles, ray casting algorithm to calculate the block hit by camera vector, merge sort algorithm to render semi-transparent blocks from far to near, AABB algorithm to detect collision, created separate thread to procedurally generate terrain, etc.(C++, BGFX, CMAKE, GLFW, GLM, IMGUI)","Personal website dev, for the purpose of practicing and trying out new technologies, I created my personal website using vanilla TypeScript and Nodejs with no frameworks, designed and created routing system, implemented middleware, developed my own command line tools, which has Webpack functionality integrated, defined lint rules, created simple session cookie based login system, simple socket.io based online game, created my own resume editor, etc.(TypeScript, Nodejs, HTML, LESS, Webpack)"]}],"techSkill":{"skill":["JavaScript","TypeScript","HTML","CSS","React","Redux","Webpack","LESS/SCSS","GIT","Agile(SCRUM) Development"],"familiar":["NodeJs","C++","JAVA","PHP","SQL","Docker","Linux","Redis","GraphQL"]}}}